In [2]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [3]:
df = pd.read_csv('data/people-example.csv')

In [4]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [5]:
df.tail()

  First Name Last Name        Country  age
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [6]:
df.head()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [7]:
df['age'].mean()

23.142857142857142

In [8]:
df['full_name'] = df['First Name']+ ' '+ df['Last Name']

In [9]:
df

  First Name Last Name        Country  age       full_name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [10]:
def transform(country):
    if country == 'USA':
        return 'United States'
    return country

In [11]:
df['Country'] = df['Country'].apply(transform)

In [12]:
df

  First Name Last Name        Country  age       full_name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

# Processing label data

In [15]:
enc = LabelEncoder()

In [16]:
type(enc)

sklearn.preprocessing.label.LabelEncoder

In [17]:
df['Country']

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [29]:
enc.fit(df['Country'])
enc.classes_

array(['Canada', 'England', 'Poland', 'Switzerland', 'United States'], dtype=object)

In [30]:
l = list(enc.classes_)
l

['Canada', 'England', 'Poland', 'Switzerland', 'United States']

In [31]:
trans = enc.transform(df['Country'])
print(trans)

[4 0 1 4 2 4 3]

In [34]:
enc.inverse_transform(trans)

array(['United States', 'Canada', 'England', 'United States', 'Poland',
       'United States', 'Switzerland'], dtype=object)

In [41]:
encoder = dict()
for column in df.columns.values:
    enc = LabelEncoder()
    enc.fit(df[column])
    encoder[column] = enc

In [45]:
encoder['Country'].transform(df['Country'])

array([4, 0, 1, 4, 2, 4, 3])

In [46]:
df['Country'] = encoder['Country'].transform(df['Country'])

In [47]:
df['Country']

0    4
1    0
2    1
3    4
4    2
5    4
6    3
Name: Country, dtype: int64